Revit 2027 API
DisplacementElement.CanCategoryBeDisplaced Method
 Indicates whether elements of the specified category are eligible as displaced elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanCategoryBeDisplaced(
	ElementId categoryId
)
Public Shared Function CanCategoryBeDisplaced (
	categoryId As ElementId
) As Boolean
public:
static bool CanCategoryBeDisplaced(
	ElementId^ categoryId
)
static member CanCategoryBeDisplaced :
        categoryId : ElementId -> bool
Parameters
categoryId ElementId
 Category id of element to be replaced.
Return Value
Boolean
 Returns true if elements of this category can be displaced, and false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Elements may be disallowed as displaced elements for reasons other than their category.
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace